name: "GoogleNet_BN_v2_FULL"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 299
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
  }
  image_data_param {
    source: "/ssd/dataset/imagenet1k/meta/train.txt"
    batch_size: 32
    shuffle: true
    new_height: 352
    new_width: 352
    root_folder: "/ssd/dataset/imagenet1k/train/"
  }
}
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 299
    mean_value: 103.939
    mean_value: 116.779
    mean_value: 123.68
  }
  image_data_param {
    source: "/ssd/dataset/imagenet1k/meta/val.txt"
    batch_size: 32
    new_height: 352
    new_width: 352
    root_folder: "/ssd/dataset/imagenet1k/val/"
  }
}
layer {
  name: "conv1/3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "conv1/3x3_s2/bn"
  type: "BatchNorm"
  bottom: "conv1/3x3_s2"
  top: "conv1/3x3_s2/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "conv1/relu_3x3_s2"
  type: "ReLU"
  bottom: "conv1/3x3_s2/bn"
  top: "conv1/3x3_s2/bn"
}
layer {
  name: "conv2/3x3"
  type: "Convolution"
  bottom: "conv1/3x3_s2/bn"
  top: "conv2/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "conv2/3x3/bn"
  type: "BatchNorm"
  bottom: "conv2/3x3"
  top: "conv2/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "conv2/relu_3x3"
  type: "ReLU"
  bottom: "conv2/3x3/bn"
  top: "conv2/3x3/bn"
}
layer {
  name: "conv3/3x3"
  type: "Convolution"
  bottom: "conv2/3x3/bn"
  top: "conv3/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "conv3/3x3/bn"
  type: "BatchNorm"
  bottom: "conv3/3x3"
  top: "conv3/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "conv3/relu_3x3"
  type: "ReLU"
  bottom: "conv3/3x3/bn"
  top: "conv3/3x3/bn"
}
layer {
  name: "pool2/3x3_s2"
  type: "Pooling"
  bottom: "conv3/3x3/bn"
  top: "pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4/1x1"
  type: "Convolution"
  bottom: "pool2/3x3_s2"
  top: "conv4/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 80
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "conv4/1x1/bn"
  type: "BatchNorm"
  bottom: "conv4/1x1"
  top: "conv4/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "conv4/relu_1x1"
  type: "ReLU"
  bottom: "conv4/1x1/bn"
  top: "conv4/1x1/bn"
}
layer {
  name: "conv5/3x3"
  type: "Convolution"
  bottom: "conv4/1x1/bn"
  top: "conv5/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "conv5/3x3/bn"
  type: "BatchNorm"
  bottom: "conv5/3x3"
  top: "conv5/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "conv5/relu_3x3"
  type: "ReLU"
  bottom: "conv5/3x3/bn"
  top: "conv5/3x3/bn"
}
layer {
  name: "pool3/3x3_s2"
  type: "Pooling"
  bottom: "conv5/3x3/bn"
  top: "pool3/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception3a/1x1"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/1x1/bn"
  type: "BatchNorm"
  bottom: "inception3a/1x1"
  top: "inception3a/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_1x1"
  type: "ReLU"
  bottom: "inception3a/1x1/bn"
  top: "inception3a/1x1/bn"
}
layer {
  name: "inception3a/3x3_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception3a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3a/3x3_reduce"
  top: "inception3a/3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception3a/3x3_reduce/bn"
  top: "inception3a/3x3_reduce/bn"
}
layer {
  name: "inception3a/3x3"
  type: "Convolution"
  bottom: "inception3a/3x3_reduce/bn"
  top: "inception3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/3x3/bn"
  type: "BatchNorm"
  bottom: "inception3a/3x3"
  top: "inception3a/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_3x3"
  type: "ReLU"
  bottom: "inception3a/3x3/bn"
  top: "inception3a/3x3/bn"
}
layer {
  name: "inception3a/double3x3_reduce"
  type: "Convolution"
  bottom: "pool3/3x3_s2"
  top: "inception3a/double3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/double3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3a/double3x3_reduce"
  top: "inception3a/double3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception3a/double3x3_reduce/bn"
  top: "inception3a/double3x3_reduce/bn"
}
layer {
  name: "inception3a/double3x3a"
  type: "Convolution"
  bottom: "inception3a/double3x3_reduce/bn"
  top: "inception3a/double3x3a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/double3x3a/bn"
  type: "BatchNorm"
  bottom: "inception3a/double3x3a"
  top: "inception3a/double3x3a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_double3x3a"
  type: "ReLU"
  bottom: "inception3a/double3x3a/bn"
  top: "inception3a/double3x3a/bn"
}
layer {
  name: "inception3a/double3x3b"
  type: "Convolution"
  bottom: "inception3a/double3x3a/bn"
  top: "inception3a/double3x3b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/double3x3b/bn"
  type: "BatchNorm"
  bottom: "inception3a/double3x3b"
  top: "inception3a/double3x3b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_double3x3b"
  type: "ReLU"
  bottom: "inception3a/double3x3b/bn"
  top: "inception3a/double3x3b/bn"
}
layer {
  name: "inception3a/pool"
  type: "Pooling"
  bottom: "pool3/3x3_s2"
  top: "inception3a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception3a/pool_proj"
  type: "Convolution"
  bottom: "inception3a/pool"
  top: "inception3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 32
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3a/pool_proj/bn"
  type: "BatchNorm"
  bottom: "inception3a/pool_proj"
  top: "inception3a/pool_proj/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception3a/pool_proj/bn"
  top: "inception3a/pool_proj/bn"
}
layer {
  name: "inception3a"
  type: "Concat"
  bottom: "inception3a/1x1/bn"
  bottom: "inception3a/3x3/bn"
  bottom: "inception3a/double3x3b/bn"
  bottom: "inception3a/pool_proj/bn"
  top: "inception3a"
}
layer {
  name: "inception3b/1x1"
  type: "Convolution"
  bottom: "inception3a"
  top: "inception3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/1x1/bn"
  type: "BatchNorm"
  bottom: "inception3b/1x1"
  top: "inception3b/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_1x1"
  type: "ReLU"
  bottom: "inception3b/1x1/bn"
  top: "inception3b/1x1/bn"
}
layer {
  name: "inception3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception3a"
  top: "inception3b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3b/3x3_reduce"
  top: "inception3b/3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception3b/3x3_reduce/bn"
  top: "inception3b/3x3_reduce/bn"
}
layer {
  name: "inception3b/3x3"
  type: "Convolution"
  bottom: "inception3b/3x3_reduce/bn"
  top: "inception3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/3x3/bn"
  type: "BatchNorm"
  bottom: "inception3b/3x3"
  top: "inception3b/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_3x3"
  type: "ReLU"
  bottom: "inception3b/3x3/bn"
  top: "inception3b/3x3/bn"
}
layer {
  name: "inception3b/double3x3_reduce"
  type: "Convolution"
  bottom: "inception3a"
  top: "inception3b/double3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/double3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3b/double3x3_reduce"
  top: "inception3b/double3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception3b/double3x3_reduce/bn"
  top: "inception3b/double3x3_reduce/bn"
}
layer {
  name: "inception3b/double3x3a"
  type: "Convolution"
  bottom: "inception3b/double3x3_reduce/bn"
  top: "inception3b/double3x3a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/double3x3a/bn"
  type: "BatchNorm"
  bottom: "inception3b/double3x3a"
  top: "inception3b/double3x3a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_double3x3a"
  type: "ReLU"
  bottom: "inception3b/double3x3a/bn"
  top: "inception3b/double3x3a/bn"
}
layer {
  name: "inception3b/double3x3b"
  type: "Convolution"
  bottom: "inception3b/double3x3a/bn"
  top: "inception3b/double3x3b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/double3x3b/bn"
  type: "BatchNorm"
  bottom: "inception3b/double3x3b"
  top: "inception3b/double3x3b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_double3x3b"
  type: "ReLU"
  bottom: "inception3b/double3x3b/bn"
  top: "inception3b/double3x3b/bn"
}
layer {
  name: "inception3b/pool"
  type: "Pooling"
  bottom: "inception3a"
  top: "inception3b/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception3b/pool_proj"
  type: "Convolution"
  bottom: "inception3b/pool"
  top: "inception3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3b/pool_proj/bn"
  type: "BatchNorm"
  bottom: "inception3b/pool_proj"
  top: "inception3b/pool_proj/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3b/relu_pool_proj"
  type: "ReLU"
  bottom: "inception3b/pool_proj/bn"
  top: "inception3b/pool_proj/bn"
}
layer {
  name: "inception3b"
  type: "Concat"
  bottom: "inception3b/1x1/bn"
  bottom: "inception3b/3x3/bn"
  bottom: "inception3b/double3x3b/bn"
  bottom: "inception3b/pool_proj/bn"
  top: "inception3b"
}
layer {
  name: "inception3c/1x1"
  type: "Convolution"
  bottom: "inception3b"
  top: "inception3c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/1x1/bn"
  type: "BatchNorm"
  bottom: "inception3c/1x1"
  top: "inception3c/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_1x1"
  type: "ReLU"
  bottom: "inception3c/1x1/bn"
  top: "inception3c/1x1/bn"
}
layer {
  name: "inception3c/3x3_reduce"
  type: "Convolution"
  bottom: "inception3b"
  top: "inception3c/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 48
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3c/3x3_reduce"
  top: "inception3c/3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception3c/3x3_reduce/bn"
  top: "inception3c/3x3_reduce/bn"
}
layer {
  name: "inception3c/3x3"
  type: "Convolution"
  bottom: "inception3c/3x3_reduce/bn"
  top: "inception3c/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/3x3/bn"
  type: "BatchNorm"
  bottom: "inception3c/3x3"
  top: "inception3c/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_3x3"
  type: "ReLU"
  bottom: "inception3c/3x3/bn"
  top: "inception3c/3x3/bn"
}
layer {
  name: "inception3c/double3x3_reduce"
  type: "Convolution"
  bottom: "inception3b"
  top: "inception3c/double3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/double3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3c/double3x3_reduce"
  top: "inception3c/double3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception3c/double3x3_reduce/bn"
  top: "inception3c/double3x3_reduce/bn"
}
layer {
  name: "inception3c/double3x3a"
  type: "Convolution"
  bottom: "inception3c/double3x3_reduce/bn"
  top: "inception3c/double3x3a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/double3x3a/bn"
  type: "BatchNorm"
  bottom: "inception3c/double3x3a"
  top: "inception3c/double3x3a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_double3x3a"
  type: "ReLU"
  bottom: "inception3c/double3x3a/bn"
  top: "inception3c/double3x3a/bn"
}
layer {
  name: "inception3c/double3x3b"
  type: "Convolution"
  bottom: "inception3c/double3x3a/bn"
  top: "inception3c/double3x3b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/double3x3b/bn"
  type: "BatchNorm"
  bottom: "inception3c/double3x3b"
  top: "inception3c/double3x3b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_double3x3b"
  type: "ReLU"
  bottom: "inception3c/double3x3b/bn"
  top: "inception3c/double3x3b/bn"
}
layer {
  name: "inception3c/pool"
  type: "Pooling"
  bottom: "inception3b"
  top: "inception3c/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception3c/pool_proj"
  type: "Convolution"
  bottom: "inception3c/pool"
  top: "inception3c/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3c/pool_proj/bn"
  type: "BatchNorm"
  bottom: "inception3c/pool_proj"
  top: "inception3c/pool_proj/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3c/relu_pool_proj"
  type: "ReLU"
  bottom: "inception3c/pool_proj/bn"
  top: "inception3c/pool_proj/bn"
}
layer {
  name: "inception3c"
  type: "Concat"
  bottom: "inception3c/1x1/bn"
  bottom: "inception3c/3x3/bn"
  bottom: "inception3c/double3x3b/bn"
  bottom: "inception3c/pool_proj/bn"
  top: "inception3c"
}
layer {
  name: "inception3d/3x3_reduce"
  type: "Convolution"
  bottom: "inception3c"
  top: "inception3d/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3d/3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3d/3x3_reduce"
  top: "inception3d/3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "inception3d/3x3_reduce/bn"
  top: "inception3d/3x3_reduce/bn"
}
layer {
  name: "inception3d/3x3"
  type: "Convolution"
  bottom: "inception3d/3x3_reduce/bn"
  top: "inception3d/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 384
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3d/3x3/bn"
  type: "BatchNorm"
  bottom: "inception3d/3x3"
  top: "inception3d/3x3/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3d/relu_3x3"
  type: "ReLU"
  bottom: "inception3d/3x3/bn"
  top: "inception3d/3x3/bn"
}
layer {
  name: "inception3d/double3x3_reduce"
  type: "Convolution"
  bottom: "inception3c"
  top: "inception3d/double3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3d/double3x3_reduce/bn"
  type: "BatchNorm"
  bottom: "inception3d/double3x3_reduce"
  top: "inception3d/double3x3_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3d/relu_double3x3_reduce"
  type: "ReLU"
  bottom: "inception3d/double3x3_reduce/bn"
  top: "inception3d/double3x3_reduce/bn"
}
layer {
  name: "inception3d/double3x3a"
  type: "Convolution"
  bottom: "inception3d/double3x3_reduce/bn"
  top: "inception3d/double3x3a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3d/double3x3a/bn"
  type: "BatchNorm"
  bottom: "inception3d/double3x3a"
  top: "inception3d/double3x3a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3d/relu_double3x3a"
  type: "ReLU"
  bottom: "inception3d/double3x3a/bn"
  top: "inception3d/double3x3a/bn"
}
layer {
  name: "inception3d/double3x3b"
  type: "Convolution"
  bottom: "inception3d/double3x3a/bn"
  top: "inception3d/double3x3b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    pad: 0
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception3d/double3x3b/bn"
  type: "BatchNorm"
  bottom: "inception3d/double3x3b"
  top: "inception3d/double3x3b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception3d/relu_double3x3b"
  type: "ReLU"
  bottom: "inception3d/double3x3b/bn"
  top: "inception3d/double3x3b/bn"
}
layer {
  name: "inception3d/pool"
  type: "Pooling"
  bottom: "inception3c"
  top: "inception3d/pool/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception3d"
  type: "Concat"
  bottom: "inception3d/3x3/bn"
  bottom: "inception3d/double3x3b/bn"
  bottom: "inception3d/pool/3x3_s2"
  top: "inception3d"
}
layer {
  name: "inception4a/1x1"
  type: "Convolution"
  bottom: "inception3d"
  top: "inception4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/1x1/bn"
  type: "BatchNorm"
  bottom: "inception4a/1x1"
  top: "inception4a/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_1x1"
  type: "ReLU"
  bottom: "inception4a/1x1/bn"
  top: "inception4a/1x1/bn"
}
layer {
  name: "inception4a/1x7_reduce"
  type: "Convolution"
  bottom: "inception3d"
  top: "inception4a/1x7_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/1x7_reduce/bn"
  type: "BatchNorm"
  bottom: "inception4a/1x7_reduce"
  top: "inception4a/1x7_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_1x7_reduce"
  type: "ReLU"
  bottom: "inception4a/1x7_reduce/bn"
  top: "inception4a/1x7_reduce/bn"
}
layer {
  name: "inception4a/1x7"
  type: "Convolution"
  bottom: "inception4a/1x7_reduce/bn"
  top: "inception4a/1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/1x7/bn"
  type: "BatchNorm"
  bottom: "inception4a/1x7"
  top: "inception4a/1x7/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_1x7"
  type: "ReLU"
  bottom: "inception4a/1x7/bn"
  top: "inception4a/1x7/bn"
}
layer {
  name: "inception4a/7x1"
  type: "Convolution"
  bottom: "inception4a/1x7/bn"
  top: "inception4a/7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/7x1/bn"
  type: "BatchNorm"
  bottom: "inception4a/7x1"
  top: "inception4a/7x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_7x1"
  type: "ReLU"
  bottom: "inception4a/7x1/bn"
  top: "inception4a/7x1/bn"
}
layer {
  name: "inception4a/double7x1_reduce"
  type: "Convolution"
  bottom: "inception3d"
  top: "inception4a/double7x1_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/double7x1_reduce/bn"
  type: "BatchNorm"
  bottom: "inception4a/double7x1_reduce"
  top: "inception4a/double7x1_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_double7x1_reduce"
  type: "ReLU"
  bottom: "inception4a/double7x1_reduce/bn"
  top: "inception4a/double7x1_reduce/bn"
}
layer {
  name: "inception4a/double7x1a"
  type: "Convolution"
  bottom: "inception4a/double7x1_reduce/bn"
  top: "inception4a/double7x1a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/double7x1a/bn"
  type: "BatchNorm"
  bottom: "inception4a/double7x1a"
  top: "inception4a/double7x1a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_double7x1a"
  type: "ReLU"
  bottom: "inception4a/double7x1a/bn"
  top: "inception4a/double7x1a/bn"
}
layer {
  name: "inception4a/double1x7a"
  type: "Convolution"
  bottom: "inception4a/double7x1a/bn"
  top: "inception4a/double1x7a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/double1x7a/bn"
  type: "BatchNorm"
  bottom: "inception4a/double1x7a"
  top: "inception4a/double1x7a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_double1x7a"
  type: "ReLU"
  bottom: "inception4a/double1x7a/bn"
  top: "inception4a/double1x7a/bn"
}
layer {
  name: "inception4a/double7x1b"
  type: "Convolution"
  bottom: "inception4a/double1x7a/bn"
  top: "inception4a/double7x1b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 128
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/double7x1b/bn"
  type: "BatchNorm"
  bottom: "inception4a/double7x1b"
  top: "inception4a/double7x1b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_double7x1b"
  type: "ReLU"
  bottom: "inception4a/double7x1b/bn"
  top: "inception4a/double7x1b/bn"
}
layer {
  name: "inception4a/double1x7b"
  type: "Convolution"
  bottom: "inception4a/double7x1b/bn"
  top: "inception4a/double1x7b"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/double1x7b/bn"
  type: "BatchNorm"
  bottom: "inception4a/double1x7b"
  top: "inception4a/double1x7b/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_double1x7b"
  type: "ReLU"
  bottom: "inception4a/double1x7b/bn"
  top: "inception4a/double1x7b/bn"
}
layer {
  name: "inception4a/pool"
  type: "Pooling"
  bottom: "inception3d"
  top: "inception4a/pool"
  pooling_param {
    pool: AVE
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception4a/pool_proj"
  type: "Convolution"
  bottom: "inception4a/pool"
  top: "inception4a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4a/pool_proj/bn"
  type: "BatchNorm"
  bottom: "inception4a/pool_proj"
  top: "inception4a/pool_proj/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4a/relu_pool_proj"
  type: "ReLU"
  bottom: "inception4a/pool_proj/bn"
  top: "inception4a/pool_proj/bn"
}
layer {
  name: "inception4a"
  type: "Concat"
  bottom: "inception4a/1x1/bn"
  bottom: "inception4a/7x1/bn"
  bottom: "inception4a/double1x7b/bn"
  bottom: "inception4a/pool_proj/bn"
  top: "inception4a"
}
layer {
  name: "inception4b/1x1"
  type: "Convolution"
  bottom: "inception4a"
  top: "inception4b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/1x1/bn"
  type: "BatchNorm"
  bottom: "inception4b/1x1"
  top: "inception4b/1x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_1x1"
  type: "ReLU"
  bottom: "inception4b/1x1/bn"
  top: "inception4b/1x1/bn"
}
layer {
  name: "inception4b/1x7_reduce"
  type: "Convolution"
  bottom: "inception4a"
  top: "inception4b/1x7_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/1x7_reduce/bn"
  type: "BatchNorm"
  bottom: "inception4b/1x7_reduce"
  top: "inception4b/1x7_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_1x7_reduce"
  type: "ReLU"
  bottom: "inception4b/1x7_reduce/bn"
  top: "inception4b/1x7_reduce/bn"
}
layer {
  name: "inception4b/1x7"
  type: "Convolution"
  bottom: "inception4b/1x7_reduce/bn"
  top: "inception4b/1x7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/1x7/bn"
  type: "BatchNorm"
  bottom: "inception4b/1x7"
  top: "inception4b/1x7/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_1x7"
  type: "ReLU"
  bottom: "inception4b/1x7/bn"
  top: "inception4b/1x7/bn"
}
layer {
  name: "inception4b/7x1"
  type: "Convolution"
  bottom: "inception4b/1x7/bn"
  top: "inception4b/7x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 192
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/7x1/bn"
  type: "BatchNorm"
  bottom: "inception4b/7x1"
  top: "inception4b/7x1/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_7x1"
  type: "ReLU"
  bottom: "inception4b/7x1/bn"
  top: "inception4b/7x1/bn"
}
layer {
  name: "inception4b/double7x1_reduce"
  type: "Convolution"
  bottom: "inception4a"
  top: "inception4b/double7x1_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/double7x1_reduce/bn"
  type: "BatchNorm"
  bottom: "inception4b/double7x1_reduce"
  top: "inception4b/double7x1_reduce/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_double7x1_reduce"
  type: "ReLU"
  bottom: "inception4b/double7x1_reduce/bn"
  top: "inception4b/double7x1_reduce/bn"
}
layer {
  name: "inception4b/double7x1a"
  type: "Convolution"
  bottom: "inception4b/double7x1_reduce/bn"
  top: "inception4b/double7x1a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad_h: 3
    pad_w: 0
    kernel_h: 7
    kernel_w: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/double7x1a/bn"
  type: "BatchNorm"
  bottom: "inception4b/double7x1a"
  top: "inception4b/double7x1a/bn"
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    scale_filler {
      type: "constant"
      value: 1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    use_global_stats: true
    moving_average_fraction: 0.95
  }
}
layer {
  name: "inception4b/relu_double7x1a"
  type: "ReLU"
  bottom: "inception4b/double7x1a/bn"
  top: "inception4b/double7x1a/bn"
}
layer {
  name: "inception4b/double1x7a"
  type: "Convolution"
  bottom: "inception4b/double7x1a/bn"
  top: "inception4b/double1x7a"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 160
    pad_h: 0
    pad_w: 3
    kernel_h: 1
    kernel_w: 7
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_term: false
  }
}
layer {
  name: "inception4b/double1x7a/bn"
